; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob50) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate13)
	(at pallet1 distributor0)
	(clear crate12)
	(at pallet2 distributor1)
	(clear crate5)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 361)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 208)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(= (weight crate0) 39)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 38)
	(at crate2 distributor0)
	(on crate2 crate1)
	(= (weight crate2) 51)
	(at crate3 distributor0)
	(on crate3 crate2)
	(= (weight crate3) 67)
	(at crate4 distributor1)
	(on crate4 crate0)
	(= (weight crate4) 20)
	(at crate5 distributor1)
	(on crate5 crate4)
	(= (weight crate5) 38)
	(at crate6 distributor0)
	(on crate6 crate3)
	(= (weight crate6) 28)
	(at crate7 distributor0)
	(on crate7 crate6)
	(= (weight crate7) 8)
	(at crate8 distributor0)
	(on crate8 crate7)
	(= (weight crate8) 59)
	(at crate9 distributor0)
	(on crate9 crate8)
	(= (weight crate9) 6)
	(at crate10 depot0)
	(on crate10 pallet0)
	(= (weight crate10) 55)
	(at crate11 depot0)
	(on crate11 crate10)
	(= (weight crate11) 53)
	(at crate12 distributor0)
	(on crate12 crate9)
	(= (weight crate12) 74)
	(at crate13 depot0)
	(on crate13 crate11)
	(= (weight crate13) 59)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate5)
		(on crate2 crate7)
		(on crate3 pallet0)
		(on crate4 crate6)
		(on crate5 crate2)
		(on crate6 crate11)
		(on crate7 crate10)
		(on crate9 crate12)
		(on crate10 pallet1)
		(on crate11 crate3)
		(on crate12 crate0)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist0 crate13 crate11 depot0)
   deleted: (at crate13 depot0) (clear crate13) (available hoist0) (on crate13 crate11)
   added: (lifting hoist0 crate13) (clear crate11)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 11
2. (lift hoist1 crate12 crate9 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist1) (on crate12 crate9)
   added: (lifting hoist1 crate12) (clear crate9)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 11
3. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 2 to 12
   goals met: 0 of 11
4. (lift hoist2 crate5 crate4 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate4)
   added: (lifting hoist2 crate5) (clear crate4)
   changed: (fuel-cost) from 12 to 13
   goals met: 0 of 11
5. (drop hoist1 crate12 crate9 distributor0)
   deleted: (lifting hoist1 crate12) (clear crate9)
   added: (available hoist1) (at crate12 distributor0) (clear crate12) (on crate12 crate9)
   goals met: 0 of 11
6. (load hoist0 crate13 truck1 depot0)
   deleted: (lifting hoist0 crate13)
   added: (in crate13 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 59
   goals met: 0 of 11
7. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 13 to 23
   goals met: 0 of 11
8. (lift hoist1 crate12 crate9 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist1) (on crate12 crate9)
   added: (lifting hoist1 crate12) (clear crate9)
   changed: (fuel-cost) from 23 to 24
   goals met: 0 of 11
9. (lift hoist0 crate11 crate10 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate10)
   added: (lifting hoist0 crate11) (clear crate10)
   changed: (fuel-cost) from 24 to 25
   goals met: 0 of 11
10. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 25 to 35
   goals met: 0 of 11
11. (load hoist1 crate12 truck0 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 74
   goals met: 0 of 11
12. (lift hoist1 crate9 crate8 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate8)
   added: (lifting hoist1 crate9) (clear crate8)
   changed: (fuel-cost) from 35 to 36
   goals met: 0 of 11
13. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 36 to 46
   goals met: 0 of 11
14. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   changed: (current_load truck1) from 59 to 97
   goals met: 0 of 11
15. (lift hoist2 crate4 crate0 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate0)
   added: (lifting hoist2 crate4) (clear crate0)
   changed: (fuel-cost) from 46 to 47
   goals met: 0 of 11
16. (load hoist1 crate9 truck0 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   changed: (current_load truck0) from 74 to 80
   goals met: 0 of 11
17. (unload hoist1 crate12 truck0 distributor0)
   deleted: (in crate12 truck0) (available hoist1)
   added: (lifting hoist1 crate12)
   changed: (current_load truck0) from 80 to 6
   goals met: 0 of 11
18. (load hoist2 crate4 truck1 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   changed: (current_load truck1) from 97 to 117
   goals met: 0 of 11
19. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 47 to 48
   goals met: 0 of 11
20. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 48 to 58
   goals met: 0 of 11
21. (load hoist1 crate12 truck0 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck0) (available hoist1)
   changed: (current_load truck0) from 6 to 80
   goals met: 0 of 11
22. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 58 to 68
   goals met: 0 of 11
23. (drop hoist2 crate0 pallet2 distributor1)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 pallet2)
   goals met: 0 of 11
24. (unload hoist1 crate13 truck1 distributor0)
   deleted: (in crate13 truck1) (available hoist1)
   added: (lifting hoist1 crate13)
   changed: (current_load truck1) from 117 to 58
   goals met: 0 of 11
25. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 68 to 69
   goals met: 0 of 11
26. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 80 to 119
   goals met: 0 of 11
27. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 69 to 79
   goals met: 0 of 11
28. (load hoist1 crate13 truck0 distributor0)
   deleted: (lifting hoist1 crate13)
   added: (in crate13 truck0) (available hoist1)
   changed: (current_load truck0) from 119 to 178
   goals met: 0 of 11
29. (unload hoist1 crate12 truck0 distributor0)
   deleted: (in crate12 truck0) (available hoist1)
   added: (lifting hoist1 crate12)
   changed: (current_load truck0) from 178 to 104
   goals met: 0 of 11
30. (load hoist1 crate12 truck1 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck1) (available hoist1)
   changed: (current_load truck1) from 58 to 132
   goals met: 0 of 11
31. (unload hoist1 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck0) from 104 to 65
   goals met: 0 of 11
32. (load hoist1 crate0 truck1 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   changed: (current_load truck1) from 132 to 171
   goals met: 0 of 11
33. (lift hoist1 crate8 crate7 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist1) (on crate8 crate7)
   added: (lifting hoist1 crate8) (clear crate7)
   changed: (fuel-cost) from 79 to 80
   goals met: 0 of 11
34. (load hoist1 crate8 truck0 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   changed: (current_load truck0) from 65 to 124
   goals met: 0 of 11
35. (lift hoist1 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate6)
   added: (lifting hoist1 crate7) (clear crate6)
   changed: (fuel-cost) from 80 to 81
   goals met: 0 of 11
36. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   changed: (current_load truck0) from 124 to 132
   goals met: 0 of 11
37. (lift hoist1 crate6 crate3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate3)
   added: (lifting hoist1 crate6) (clear crate3)
   changed: (fuel-cost) from 81 to 82
   goals met: 0 of 11
38. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 132 to 160
   goals met: 0 of 11
39. (lift hoist1 crate3 crate2 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 crate2)
   added: (lifting hoist1 crate3) (clear crate2)
   changed: (fuel-cost) from 82 to 83
   goals met: 0 of 11
40. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   changed: (current_load truck0) from 160 to 227
   goals met: 0 of 11
41. (lift hoist1 crate2 crate1 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 crate1)
   added: (lifting hoist1 crate2) (clear crate1)
   changed: (fuel-cost) from 83 to 84
   goals met: 0 of 11
42. (load hoist1 crate2 truck0 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   changed: (current_load truck0) from 227 to 278
   goals met: 0 of 11
43. (unload hoist1 crate0 truck1 distributor0)
   deleted: (in crate0 truck1) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck1) from 171 to 132
   goals met: 0 of 11
44. (drop hoist0 crate11 crate10 depot0)
   deleted: (lifting hoist0 crate11) (clear crate10)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 crate10)
   goals met: 0 of 11
45. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 278 to 317
   goals met: 0 of 11
46. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 84 to 85
   goals met: 0 of 11
47. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 317 to 355
   goals met: 0 of 11
48. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 355 to 304
   goals met: 0 of 11
49. (load hoist1 crate2 truck1 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   changed: (current_load truck1) from 132 to 183
   goals met: 0 of 11
50. (unload hoist1 crate13 truck0 distributor0)
   deleted: (in crate13 truck0) (available hoist1)
   added: (lifting hoist1 crate13)
   changed: (current_load truck0) from 304 to 245
   goals met: 0 of 11
51. (drop hoist1 crate13 pallet1 distributor0)
   deleted: (lifting hoist1 crate13) (clear pallet1)
   added: (available hoist1) (at crate13 distributor0) (clear crate13) (on crate13 pallet1)
   goals met: 0 of 11
52. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck1) from 183 to 163
   goals met: 0 of 11
53. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 245 to 265
   goals met: 0 of 11
54. (lift hoist0 crate11 crate10 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate10)
   added: (lifting hoist0 crate11) (clear crate10)
   changed: (fuel-cost) from 85 to 86
   goals met: 0 of 11
55. (unload hoist1 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck0) from 265 to 226
   goals met: 0 of 11
56. (drop hoist1 crate0 crate13 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate13)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 crate13)
   goals met: 0 of 11
57. (unload hoist1 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck1) from 163 to 112
   goals met: 0 of 11
58. (load hoist1 crate2 truck0 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   changed: (current_load truck0) from 226 to 277
   goals met: 0 of 11
59. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 277 to 257
   goals met: 0 of 11
60. (load hoist1 crate4 truck1 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   changed: (current_load truck1) from 112 to 132
   goals met: 0 of 11
61. (unload hoist1 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck0) from 257 to 251
   goals met: 0 of 11
62. (drop hoist1 crate9 crate0 distributor0)
   deleted: (lifting hoist1 crate9) (clear crate0)
   added: (available hoist1) (at crate9 distributor0) (clear crate9) (on crate9 crate0)
   goals met: 0 of 11
63. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 251 to 200
   goals met: 0 of 11
64. (drop hoist1 crate2 crate9 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate9)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 crate9)
   goals met: 0 of 11
65. (unload hoist1 crate12 truck1 distributor0)
   deleted: (in crate12 truck1) (available hoist1)
   added: (lifting hoist1 crate12)
   changed: (current_load truck1) from 132 to 58
   goals met: 0 of 11
66. (load hoist1 crate12 truck0 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck0) (available hoist1)
   changed: (current_load truck0) from 200 to 274
   goals met: 0 of 11
67. (lift hoist1 crate2 crate9 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 crate9)
   added: (lifting hoist1 crate2) (clear crate9)
   changed: (fuel-cost) from 86 to 87
   goals met: 0 of 11
68. (load hoist1 crate2 truck1 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   changed: (current_load truck1) from 58 to 109
   goals met: 0 of 11
69. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck1) from 109 to 89
   goals met: 0 of 11
70. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 274 to 294
   goals met: 0 of 11
71. (unload hoist1 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck1) from 89 to 51
   goals met: 0 of 11
72. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 294 to 332
   goals met: 0 of 11
73. (unload hoist1 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck0) from 332 to 273
   goals met: 0 of 11
74. (load hoist1 crate8 truck1 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck1) (available hoist1)
   changed: (current_load truck1) from 51 to 110
   goals met: 0 of 11
75. (unload hoist1 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck1) from 110 to 59
   goals met: 0 of 11
76. (drop hoist1 crate2 crate9 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate9)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 crate9)
   goals met: 0 of 11
77. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 87 to 97
   goals met: 0 of 11
78. (load hoist0 crate11 truck1 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck1) (available hoist0)
   changed: (current_load truck1) from 59 to 112
   goals met: 0 of 11
79. (lift hoist0 crate10 pallet0 depot0)
   deleted: (at crate10 depot0) (clear crate10) (available hoist0) (on crate10 pallet0)
   added: (lifting hoist0 crate10) (clear pallet0)
   changed: (fuel-cost) from 97 to 98
   goals met: 0 of 11
80. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 273 to 253
   goals met: 0 of 11
81. (load hoist0 crate10 truck1 depot0)
   deleted: (lifting hoist0 crate10)
   added: (in crate10 truck1) (available hoist0)
   changed: (current_load truck1) from 112 to 167
   goals met: 0 of 11
82. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 98 to 108
   goals met: 0 of 11
83. (load hoist1 crate4 truck1 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   changed: (current_load truck1) from 167 to 187
   goals met: 0 of 11
84. (lift hoist1 crate2 crate9 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 crate9)
   added: (lifting hoist1 crate2) (clear crate9)
   changed: (fuel-cost) from 108 to 109
   goals met: 0 of 11
85. (load hoist1 crate2 truck0 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   changed: (current_load truck0) from 253 to 304
   goals met: 0 of 11
86. (lift hoist1 crate9 crate0 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate0)
   added: (lifting hoist1 crate9) (clear crate0)
   changed: (fuel-cost) from 109 to 110
   goals met: 0 of 11
87. (load hoist1 crate9 truck0 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   changed: (current_load truck0) from 304 to 310
   goals met: 0 of 11
88. (lift hoist1 crate0 crate13 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 crate13)
   added: (lifting hoist1 crate0) (clear crate13)
   changed: (fuel-cost) from 110 to 111
   goals met: 0 of 11
89. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 111 to 121
   goals met: 0 of 11
90. (unload hoist0 crate8 truck1 depot0)
   deleted: (in crate8 truck1) (available hoist0)
   added: (lifting hoist0 crate8)
   changed: (current_load truck1) from 187 to 128
   goals met: 0 of 11
91. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 121 to 131
   goals met: 0 of 11
92. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 310 to 349
   goals met: 0 of 11
93. (lift hoist1 crate13 pallet1 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist1) (on crate13 pallet1)
   added: (lifting hoist1 crate13) (clear pallet1)
   changed: (fuel-cost) from 131 to 132
   goals met: 0 of 11
94. (load hoist1 crate13 truck1 distributor0)
   deleted: (lifting hoist1 crate13)
   added: (in crate13 truck1) (available hoist1)
   changed: (current_load truck1) from 128 to 187
   goals met: 0 of 11
95. (unload hoist1 crate10 truck1 distributor0)
   deleted: (in crate10 truck1) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck1) from 187 to 132
   goals met: 0 of 11
96. (drop hoist1 crate10 pallet1 distributor0)
   deleted: (lifting hoist1 crate10) (clear pallet1)
   added: (available hoist1) (at crate10 distributor0) (clear crate10) (on crate10 pallet1)
   goals met: 1 of 11
97. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 132 to 142
   goals met: 1 of 11
98. (unload hoist1 crate12 truck0 distributor0)
   deleted: (in crate12 truck0) (available hoist1)
   added: (lifting hoist1 crate12)
   changed: (current_load truck0) from 349 to 275
   goals met: 1 of 11
99. (load hoist0 crate8 truck1 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck1) (available hoist0)
   changed: (current_load truck1) from 132 to 191
   goals met: 1 of 11
100. (unload hoist0 crate13 truck1 depot0)
   deleted: (in crate13 truck1) (available hoist0)
   added: (lifting hoist0 crate13)
   changed: (current_load truck1) from 191 to 132
   goals met: 1 of 11
101. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 142 to 152
   goals met: 1 of 11
102. (load hoist1 crate12 truck1 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck1) (available hoist1)
   changed: (current_load truck1) from 132 to 206
   goals met: 1 of 11
103. (unload hoist1 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 275 to 267
   goals met: 1 of 11
104. (drop hoist1 crate7 crate10 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate10)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate10)
   goals met: 2 of 11
105. (unload hoist1 crate11 truck1 distributor0)
   deleted: (in crate11 truck1) (available hoist1)
   added: (lifting hoist1 crate11)
   changed: (current_load truck1) from 206 to 153
   goals met: 2 of 11
106. (load hoist1 crate11 truck0 distributor0)
   deleted: (lifting hoist1 crate11)
   added: (in crate11 truck0) (available hoist1)
   changed: (current_load truck0) from 267 to 320
   goals met: 2 of 11
107. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 320 to 269
   goals met: 2 of 11
108. (drop hoist1 crate2 crate7 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate7)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 crate7)
   goals met: 3 of 11
109. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 269 to 231
   goals met: 3 of 11
110. (drop hoist1 crate5 crate2 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate2)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate2)
   goals met: 4 of 11
111. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck1) from 153 to 133
   goals met: 4 of 11
112. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 231 to 251
   goals met: 4 of 11
113. (unload hoist1 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck0) from 251 to 245
   goals met: 4 of 11
114. (load hoist1 crate9 truck1 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck1) (available hoist1)
   changed: (current_load truck1) from 133 to 139
   goals met: 4 of 11
115. (unload hoist1 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck0) from 245 to 206
   goals met: 4 of 11
116. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 152 to 162
   goals met: 4 of 11
117. (drop hoist1 crate0 crate5 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate5)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 crate5)
   goals met: 5 of 11
118. (load hoist0 crate13 truck0 depot0)
   deleted: (lifting hoist0 crate13)
   added: (in crate13 truck0) (available hoist0)
   changed: (current_load truck0) from 206 to 265
   goals met: 5 of 11
119. (unload hoist0 crate3 truck0 depot0)
   deleted: (in crate3 truck0) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck0) from 265 to 198
   goals met: 5 of 11
120. (drop hoist0 crate3 pallet0 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 6 of 11
121. (unload hoist0 crate11 truck0 depot0)
   deleted: (in crate11 truck0) (available hoist0)
   added: (lifting hoist0 crate11)
   changed: (current_load truck0) from 198 to 145
   goals met: 6 of 11
122. (unload hoist1 crate12 truck1 distributor0)
   deleted: (in crate12 truck1) (available hoist1)
   added: (lifting hoist1 crate12)
   changed: (current_load truck1) from 139 to 65
   goals met: 6 of 11
123. (drop hoist1 crate12 crate0 distributor0)
   deleted: (lifting hoist1 crate12) (clear crate0)
   added: (available hoist1) (at crate12 distributor0) (clear crate12) (on crate12 crate0)
   goals met: 7 of 11
124. (drop hoist0 crate11 crate3 depot0)
   deleted: (lifting hoist0 crate11) (clear crate3)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 crate3)
   goals met: 8 of 11
125. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck0) from 145 to 117
   goals met: 8 of 11
126. (drop hoist0 crate6 crate11 depot0)
   deleted: (lifting hoist0 crate6) (clear crate11)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate11)
   goals met: 9 of 11
127. (unload hoist1 crate9 truck1 distributor0)
   deleted: (in crate9 truck1) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck1) from 65 to 59
   goals met: 9 of 11
128. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck0) from 117 to 97
   goals met: 9 of 11
129. (drop hoist0 crate4 crate6 depot0)
   deleted: (lifting hoist0 crate4) (clear crate6)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate6)
   goals met: 10 of 11
130. (drop hoist1 crate9 crate12 distributor0)
   deleted: (lifting hoist1 crate9) (clear crate12)
   added: (available hoist1) (at crate9 distributor0) (clear crate9) (on crate9 crate12)
   goals met: 11 of 11
